samples/expression_tree_dot/xor_mn.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "XOR", fillcolor = "lightpink", style = "filled", name = "node1"];
  "node2" [label = "m", fillcolor = "lightblue", style = "filled", name = "node2"];
  "node3" [label = "n", fillcolor = "lightblue", style = "filled", name = "node3"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
}
